wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
/**************************************************************************************************
* Copyright (C), 1997-$(Year),  HAICHUANG IOT Tech. Co., Ltd.
* 文件<$(filename)>
* 模块描述 :	定义、功能、说明
* 历史修改记录
*     <主要修改者>  <时间>   <版本 >   <说明>
*     xlyan        $(Date)   1.0.0    创建文件
**************************************************************************************************/
#include "ILI9326.h"

#include "STM32_GPIO.H"
#include "STM32_PWM.H"
#include "font.h"

#include "STM32_SYSTICK.H"

//#ifdef LCD_61509_EN

t_LcdCfg g_ILI9326Cfg;

u16 ILI9326_Rotate=SCREEN_ROTATE_270D;			//屏方向

sLCD_def *sLCDs=0;

u16 ILI9326_BACK_COLOR	=	ILI9326_WHITE;		//背景色
u16 ILI9326_POINT_COLOR	=	ILI9326_BLACK;   	//画笔色

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ILI9326_Delay(u32 xms)
{
	while(xms--);
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ILI9326_Initialize(sLCD_def *sLCD)
{
	sLCDs=sLCD;
	
	GPIO_Configuration_OPP50	(sLCDs->sPort.sBL_PORT,				sLCDs->sPort.sBL_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(sLCDs->sPort.sRD_PORT,				sLCDs->sPort.sRD_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(sLCDs->sPort.sREST_PORT,			sLCDs->sPort.sREST_Pin);				//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(sLCDs->sPort.sRS_PORT,				sLCDs->sPort.sRS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(sLCDs->sPort.sWR_PORT,				sLCDs->sPort.sWR_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(sLCDs->sPort.sCS_PORT,				sLCDs->sPort.sCS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(sLCDs->sPort.sTE_PORT,				sLCDs->sPort.sTE_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(sLCDs->sPort.sDATABUS_PORT,	sLCDs->sPort.sDATABUS_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	
	
	
	ILI9326_BL_ON;
	
	ILI9326_Initialize0();		////按照主控芯片ILI9326的power supply on sequence 进行配置
	
//	ILI9326_Delay(1000);
//	ILI9326_Delay(1000);
//	ILI9326_Delay(1000);
//	ILI9326_Delay(1000);
//	ILI9326_Delay(1000);
//	ILI9326_Delay(1000);
//	ILI9326_Delay(1000);
//	ILI9326_Delay(1000);
	
//	ILI9326_PowerOn();
}
/**************************************************************************************************
* [Function] ILI9326_GetCfg:  函数功能、注意事项等的描述
* [No param][return]*: description
**************************************************************************************************/
t_LcdCfg * ILI9326_GetCfg( void )
{
	return(&g_ILI9326Cfg);
}


/**************************************************************************************************
* [Function] LCD_WriteCom:  函数功能、注意事项等的描述
* [param01]u16 Com: description
**************************************************************************************************/
void ILI9326_Write_Bus( u16 Com )
{
	ILI9326_CS_LOW;
	ILI9326_RD_HIGH;
	ILI9326_RS_LOW;					//寄存器选择信号 1:选择索引或者状态寄存器;0:控制寄存器
	ILI9326_DATABUS_PORT->ODR = Com;
	ILI9326_WR_LOW;
	ILI9326_WR_HIGH;
	ILI9326_CS_HIGH;
}

#if 1

/**************************************************************************************************
* [Function] LCD_WriteData:  函数功能、注意事项等的描述
* [param01]u16 Dat: description
**************************************************************************************************/
void ILI9326_WriteData( u16 Dat )
{
	ILI9326_CS_LOW;
	ILI9326_RD_HIGH;
	ILI9326_RS_HIGH;		//寄存器选择信号 1:选择索引或者状态寄存器;0:控制寄存器
	ILI9326_DATABUS_PORT->ODR = Dat;
	ILI9326_WR_LOW;
	ILI9326_WR_HIGH;
	ILI9326_CS_HIGH;
}

#endif


//写16位数据：
void ILI9326_WriteData16(unsigned int dashuju)			//写16位数据
{
	ILI9326_CS_LOW; //片选打开
	ILI9326_RS_HIGH; //命令  寄存器选择信号 1:选择索引或者状态寄存器;0:控制寄存器
	ILI9326_WR_LOW;
	ILI9326_Delay(20);
	ILI9326_DATABUS_PORT->ODR = dashuju;
	ILI9326_Delay(20);
	ILI9326_WR_HIGH;
	ILI9326_CS_HIGH;
	ILI9326_Delay(20);
}


/*******************************************************************************
*函数名			:	ILI9326_WriteIndex
*功能描述		:	写控制寄存器--写命令
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ILI9326_WriteIndex(unsigned int damingling)	//写16位命令索引编号
{
	ILI9326_CS_LOW; //片选打开
	ILI9326_RS_LOW; //命令  寄存器选择信号 1:选择索引或者状态寄存器;0:控制寄存器
	ILI9326_WR_LOW;
//	ILI9326_Delay(20);
	ILI9326_DATABUS_PORT->ODR = damingling;
//	ILI9326_Delay(20);
	ILI9326_WR_HIGH;
	ILI9326_CS_HIGH;
//	ILI9326_Delay(20);
}


/**************************************************************************************************
* [Function] LCD_WriteCMD: 向lcd写入指令数据
* [param01]u16 addr: 指令
* [param02]u16 Data: 指令数据
**************************************************************************************************/
void ILI9326_WriteCMD( u16 addr, u16 Data )
{
/*
 * LCD_WriteCom( addr );
 * LCD_WriteData( Data );
 */

	ILI9326_CS_LOW;
	ILI9326_RD_HIGH;
	ILI9326_RS_LOW;			//寄存器选择信号 1:选择索引或者状态突破口;0:控制寄存器
	ILI9326_DATABUS_PORT->ODR = addr;
	ILI9326_WR_LOW;
	ILI9326_WR_HIGH;
	ILI9326_CS_HIGH;
	/*Delay_us( 200 ); */

	ILI9326_CS_LOW;
	ILI9326_RD_HIGH;
	ILI9326_RS_HIGH;
	ILI9326_DATABUS_PORT->ODR = Data;
	ILI9326_WR_LOW;
	ILI9326_WR_HIGH;
	ILI9326_CS_HIGH;
}


/**************************************************************************************************
* [Function] LCD_ReadData:  从LCD读取数据
* [No param][return]u16: 返回数据
**************************************************************************************************/
u16 ILI9326_ReadData( void )
{
	u16 Dat;

	ILI9326_CS_LOW;
	ILI9326_WR_HIGH;
	ILI9326_RS_HIGH;
	Dat = ILI9326_DATABUS_PORT->IDR;
	ILI9326_RD_LOW;
	ILI9326_RD_HIGH;
	ILI9326_CS_HIGH;

