wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
	return(Dat);
}


/**************************************************************************************************
* [Function] LCD_SetDrawWindow:  LCD 屏显示扫描方式
* [param01]t_ILI9326_Rotate ScrnRotat: 相对于逐行从左到右 翻转角度值
* [param02]t_PixCfg PixCfg: 显示像素配置
* [param03]t_Point top_p: 顶点坐标
* [param04]u16 bottom_p: 底部坐标
**************************************************************************************************/
void ILI9326_SetDrawWindow( t_Point top_p, t_Point bottom_p )
{
	u16 HSA, HEA, VSA, VEA;

	switch ( ILI9326_GetCfg()->ScrnRotat )
	{
	case SCREEN_ROTATE_0D:
	{
		HSA	= top_p.x;
		HEA	= bottom_p.x;
		VSA	= top_p.y;
		VEA	= bottom_p.y;
		break;
	}
	case SCREEN_ROTATE_90D:
	{
		HSA	= ILI9326_GetCfg()->PixCfg.YPixNum - bottom_p.y - 1;
		HEA	= ILI9326_GetCfg()->PixCfg.YPixNum - top_p.y - 1;
		VSA	= top_p.x;
		VEA	= bottom_p.x;
		break;
	}
	case SCREEN_ROTATE_180D:
	{
		HSA	= ILI9326_GetCfg()->PixCfg.XPixNum - bottom_p.x - 1;
		HEA	= ILI9326_GetCfg()->PixCfg.XPixNum - top_p.x - 1;
		VSA	= ILI9326_GetCfg()->PixCfg.YPixNum - bottom_p.y - 1;
		VEA	= ILI9326_GetCfg()->PixCfg.YPixNum - top_p.y - 1;
		break;
	}
	case SCREEN_ROTATE_270D:
	{
		HSA	= top_p.y;
		HEA	= bottom_p.y;
		VSA	= ILI9326_GetCfg()->PixCfg.XPixNum - bottom_p.x - 1;
		VEA	= ILI9326_GetCfg()->PixCfg.XPixNum - top_p.x - 1;
		break;
	}
	default: break;
	}
	ILI9326_WriteCMD( ILI9326_R210_HSA, HSA );
	ILI9326_WriteCMD( ILI9326_R211_HEA, HEA );
	ILI9326_WriteCMD( ILI9326_R212_VSA, VSA );
	ILI9326_WriteCMD( ILI9326_R213_VEA, VEA );
}


/**************************************************************************************************
* [Function] LCD_DrawDot:  画点
* [param01]t_Point StartPos: description
* [param02]u16 color: description
**************************************************************************************************/
void ILI9326_DrawDotest(u16 x,u16 y, u16 color )
{
	/*
	 * t_Point endpos;
	 * u16 FWidth=1,FHeight=1;
	 * endpos.x	= StartPos.x + FWidth - 1;
	 * endpos.y	= StartPos.y + FHeight - 1;
	 */
//	if ( LCD_TRANSPARENT_COLOR != color )
//	{

		u16 HSA, HEA, VSA, VEA;
			HSA	= x;
			HEA	= x;
			VSA	= y;
			VEA	= y;
//#define Y_H	399     /*LCD_PHY_HEIGHT-1  CD_GetCfg()->PixCfg.YPixNum-1 */
//#define X_W	239     /*LCD_PHY_WIDTH-1  CD_GetCfg()->PixCfg.xPixNum-1 */

//		switch ( ILI9326_GetCfg()->ScrnRotat )
//		{
//		case SCREEN_ROTATE_0D:
//		{
//			HSA	= StartPos.x;
//			HEA	= StartPos.x;
//			VSA	= StartPos.y;
//			VEA	= StartPos.y;
//			break;
//		}
//		case SCREEN_ROTATE_90D:
//		{
//			HSA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			HEA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			VSA	= StartPos.x;
//			VEA	= StartPos.x;
//			break;
//		}
//		case SCREEN_ROTATE_180D:
//		{
//			HSA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
//			HEA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
//			VSA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			VEA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			break;
//		}
//		case SCREEN_ROTATE_270D:
//		{
//			HSA	= StartPos.y;
//			HEA	= StartPos.y;
//			VSA	= ILI9326_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
//			VEA	= ILI9326_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
//			break;
//		}
//		default: break;
//		}
		ILI9326_WriteCMD( ILI9326_R210_HSA, HSA );
		ILI9326_WriteCMD( ILI9326_R211_HEA, HEA );
		ILI9326_WriteCMD( ILI9326_R212_VSA, VSA );
		ILI9326_WriteCMD( ILI9326_R213_VEA, VEA );


		ILI9326_WriteCMD( ILI9326_R200_HA, HSA );
		ILI9326_WriteCMD( ILI9326_R201_VA, VSA );
		ILI9326_Write_Bus( ILI9326_R202_GDRW );


		ILI9326_WriteData(color);

}
/**************************************************************************************************
* [Function] LCD_DrawDot:  画点
* [param01]t_Point StartPos: description
* [param02]u16 color: description
**************************************************************************************************/
void ILI9326_DrawDotB( t_Point StartPos, u16 color )
{
	/*
	 * t_Point endpos;
	 * u16 FWidth=1,FHeight=1;
	 * endpos.x	= StartPos.x + FWidth - 1;
	 * endpos.y	= StartPos.y + FHeight - 1;
	 */
	if ( LCD_TRANSPARENT_COLOR != color )
	{
	#if 1
		u16 HSA, HEA, VSA, VEA;
#define Y_H	399     /*LCD_PHY_HEIGHT-1  CD_GetCfg()->PixCfg.YPixNum-1 */
#define X_W	239     /*LCD_PHY_WIDTH-1  CD_GetCfg()->PixCfg.xPixNum-1 */

		switch ( ILI9326_GetCfg()->ScrnRotat )
		{
		case SCREEN_ROTATE_0D:
		{
			HSA	= StartPos.x;
			HEA	= StartPos.x;
			VSA	= StartPos.y;
			VEA	= StartPos.y;
			break;
		}
		case SCREEN_ROTATE_90D:
		{
			HSA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			HEA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			VSA	= StartPos.x;
			VEA	= StartPos.x;
			break;
		}
		case SCREEN_ROTATE_180D:
		{
			HSA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
			HEA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
			VSA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			VEA	= ILI9326_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			break;
		}
		case SCREEN_ROTATE_270D:
		{
			HSA	= StartPos.y;
			HEA	= StartPos.y;
			VSA	= ILI9326_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
			VEA	= ILI9326_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
			break;
		}
		default: break;
		}
		ILI9326_WriteCMD( ILI9326_R210_HSA, HSA );			//Window Horizontal RAM Address Start (R210h),
		ILI9326_WriteCMD( ILI9326_R211_HEA, HEA );			//Window Horizontal RAM Address End (R211h)
		ILI9326_WriteCMD( ILI9326_R212_VSA, VSA );			//Window Vertical RAM Address Start (R212h),
		ILI9326_WriteCMD( ILI9326_R213_VEA, VEA );			//Window Vertical RAM Address End (R213h)


		ILI9326_WriteCMD( ILI9326_R200_HA, HSA );			//RAM Address Set (Horizontal Address) (R200h)
		ILI9326_WriteCMD( ILI9326_R201_VA, VSA );			//RAM Address Set (Vertical Address) (R201h)
		ILI9326_Write_Bus( ILI9326_R202_GDRW );
#else
		/*
		 * LCD_SetDrawWindow( StartPos, StartPos);
		 * LCD_SetGramAddress( StartPos );
		 */
#endif
		ILI9326_WriteData(color);
/*
		LCD_CS_LOW;
		LCD_RD_HIGH;
		LCD_RS_HIGH;

		LCD_DATA_PORT->ODR = color;
		LCD_WR_LOW;
		LCD_WR_HIGH;
		LCD_CS_HIGH;*/
	}
}

void ILI9326_EndDrawDot(void)
{
	ILI9326_CS_HIGH;

