wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
}
/**************************************************************************************************
* [Function] LCD_SetGramAddress:  设置当前操作坐标点
* [param01]t_ILI9326_Rotate ScrnRotat: 相对于逐行从左到右 翻转角度值
* [param02]t_PixCfg PixCfg: 显示像素配置
* [param03]t_Point point: 坐标点值
**************************************************************************************************/
void ILI9326_SetGramAddress( t_Point point )
{
	u16 HA0 = 0, VA0 = 0;


	switch ( ILI9326_GetCfg()->ScrnRotat )
	{
	case SCREEN_ROTATE_0D:
	{
		HA0	= point.x;
		VA0	= point.y;
		break;
	}
	case SCREEN_ROTATE_90D:
	{
		HA0	= ILI9326_GetCfg()->PixCfg.YPixNum - point.y - 1;
		VA0	= point.x;
		break;
	}
	case SCREEN_ROTATE_180D:
	{
		HA0	= ILI9326_GetCfg()->PixCfg.XPixNum - point.x - 1;
		VA0	= ILI9326_GetCfg()->PixCfg.YPixNum - point.y - 1;
		break;
	}
	case SCREEN_ROTATE_270D:
	{	

		HA0	= point.y;
		VA0	= ILI9326_GetCfg()->PixCfg.XPixNum - point.x - 1;
		break;
	}
	default: break;
	}

	ILI9326_WriteCMD( ILI9326_R200_HA, HA0 );
	ILI9326_WriteCMD( ILI9326_R201_VA, VA0 );
	ILI9326_Write_Bus( ILI9326_R202_GDRW );
}


/**************************************************************************************************
* [Function] LCD_Setbackground:  设置背景颜色
* [param01]u16 BackColor: 背景颜色值
**************************************************************************************************/
void ILI9326_Setbackground( u32 TotalPix, u16 BackColor )
{
	u32 i;

	ILI9326_CS_LOW;
	ILI9326_RD_HIGH;
	ILI9326_RS_HIGH;

	for ( i = 0; i < TotalPix; i++ )
	{
		ILI9326_DATABUS_PORT->ODR = BackColor;
		ILI9326_WR_LOW;
		ILI9326_WR_HIGH;
	}
	ILI9326_CS_HIGH;
}


/**************************************************************************************************
* [Function] LCD_SetDrawMode:  函数功能、注意事项等的描述
* [No param]
**************************************************************************************************/
void ILI9326_SetDrawMode( void )
{
#define BGR	( (u16) 1 << 12)        /*RGB顺序 */
#define DFM	( (u16) 1 << 14)        /*16-bit颜色，只能使用16-bit/8-bit接口 */
#define TRI	( (u16) 0 << 15)        /*8-bit接口下两次传输，16-bit接口下一次传输 */

	u8 Dat, HR, VR, AM, ORG;

	const u8 VHM[4][4][2] = { 6, 4, 5, 7, 0, 2, 3, 1,
				  5, 1, 0, 4, 3, 7, 6, 2,
				  0, 2, 3, 1, 6, 4, 5, 7,
				  3, 7, 6, 2, 5, 1, 0, 4 };


	if ( ILI9326_GetCfg()->DrawMode.Mode == 0 )
	{
		ORG	= 0;
		VR	= 0;
		HR	= 0;
		AM	= 0;
	}else {
		ORG	= 0;
		Dat	= VHM[ILI9326_GetCfg()->ScrnRotat][ILI9326_GetCfg()->DrawMode.Rotat][ILI9326_GetCfg()->DrawMode.Mirror];
		if ( Dat & 0x04 )
			VR = 1;
		else
			VR = 0;
		if ( Dat & 0x02 )
			HR = 1;
		else
			HR = 0;
		if ( Dat & 0x01 )
			AM = 1;
		else
			AM = 0;
	}

	ILI9326_WriteCMD( ILI9326_R003_EM, TRI | DFM | BGR | (ORG << 7) | (VR << 5) | (HR << 4) | (AM << 3) );
}


/**************************************************************************************************
* [Function] LCD_PowerOff:  关闭LCD 电源
* [No param]
**************************************************************************************************/
void ILI9326_PowerOff( void )
{
	ILI9326_WriteCMD( ILI9326_R009_DC3, 0 );
	ILI9326_Delay( 1 );
	ILI9326_BL_OFF;
}


/**************************************************************************************************
* [Function] LCD_DispOff:  关闭LCD显示( 黑屏?)
* [No param]
**************************************************************************************************/
void ILI9326_DispOff( void )
{
	ILI9326_WriteCMD( ILI9326_R007_DC1, 0x0000 );
}


/**************************************************************************************************
* [Function] LCD_PowerOn: LCD 上电并初始化相关寄存器
* [No param]
**************************************************************************************************/
void ILI9326_PowerOn( void )
{
	ILI9326_RST_HIGH;
	ILI9326_Delay( 10 );
	ILI9326_RST_LOW;
	ILI9326_Delay( 20 );
	ILI9326_RST_HIGH;
	ILI9326_Delay( 50 );

	ILI9326_BL_ON;
	
	ILI9326_WriteCMD( ILI9326_R000_IR, 0x0000 );
	ILI9326_WriteCMD( ILI9326_R000_IR, 0x0000 );
	ILI9326_WriteCMD( ILI9326_R000_IR, 0x0000 );
	ILI9326_WriteCMD( ILI9326_R000_IR, 0x0000 );
	ILI9326_Delay( 100 );
	ILI9326_WriteCMD( ILI9326_R400_BINL, 0x6400 );   /*50*8 lines LCD,start scan at line 0 */
	ILI9326_WriteCMD( ILI9326_R008_DC2, 0x0808 );    /*8 lines for front and back porch period */
	
	ILI9326_WriteCMD( ILI9326_R300_YC1, 0x0C00 );    /*gammar correction */
	ILI9326_WriteCMD( ILI9326_R301_YC2, 0x5A0B );
	ILI9326_WriteCMD( ILI9326_R302_YC3, 0x0906 );
	ILI9326_WriteCMD( ILI9326_R303_YC4, 0x1017 );
	ILI9326_WriteCMD( ILI9326_R304_YC5, 0x2300 );
	ILI9326_WriteCMD( ILI9326_R305_YC6, 0x1700 );
	ILI9326_WriteCMD( ILI9326_R306_YC7, 0x6309 );
	ILI9326_WriteCMD( ILI9326_R307_YC8, 0x0C09 );
	ILI9326_WriteCMD( ILI9326_R308_YC9, 0x100C );
	ILI9326_WriteCMD( ILI9326_R309_YC10, 0x2232 );
	
	ILI9326_WriteCMD( ILI9326_R010_PIC1, 0x0019 );   /*25 clocks per line */
	
	ILI9326_WriteCMD( ILI9326_R100_PC1, 0x0330 );    /*LCD in highest current,set-up factor */
	ILI9326_WriteCMD( ILI9326_R101_PC2, 0x0247 );    /*set-up 1 and 2 clock frequence,VCI voltage */
	ILI9326_WriteCMD( ILI9326_R102_PC3, 0xC1B0 );    /*power on */
	
	ILI9326_Delay( 50 );
	
	ILI9326_WriteCMD( ILI9326_R009_DC3, 0x0001 );    /*source output level to drive non-display V0 to V63 */
	ILI9326_WriteCMD( ILI9326_R00B_ECC, 0x0000 );    /*262k colors */
	
	ILI9326_WriteCMD( ILI9326_R00C_EDIC1, 0x0000 );  /*18-bit RGB interface,interal clock interface,RAM access via system interface,RAM write cycle 1frame */
	ILI9326_WriteCMD( ILI9326_R00F_EDIC2, 0x0000 );  /*DOTCLOCK HSYNCX VSYNCX polarity(RGB IF) */
	
	ILI9326_WriteCMD( ILI9326_R011_PIC2, 0x0101 );   /* 1clock in adjacent gate,1clock source output delay period */
	ILI9326_WriteCMD( ILI9326_R012_PIC3, 0x0000 );   /*0 clock VCOM equalize period,0clock source equalize period */
	ILI9326_WriteCMD( ILI9326_R013_PIC4, 0x0001 );   /* 1clock VCOM alternating timing */
	ILI9326_WriteCMD( ILI9326_R014_PIC5, 0x0055 );   /*dotclock high and low period ratio(RGB IF) */
	ILI9326_WriteCMD( ILI9326_R020_PIC6, 0x0019 );   /*DIV of dotclock,dotclock in 1line period (RGB IF) */
	ILI9326_WriteCMD( ILI9326_R021_PIC7, 0x0101 );   /* 1 clock in non-overlap of adjacent gate output and source output delay */
	ILI9326_WriteCMD( ILI9326_R022_PIC8, 0x0000 );   /*0 clock in low power VCOM drive and source equalize(RGB IF) */
	ILI9326_WriteCMD( ILI9326_R023_PIC9, 0x0001 );   /* 1 clock VCOM alternating point (RGB IF) */
	
