wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
	ILI9326_WriteCMD( ILI9326_R090_FMC, 0x0000 );    /* */
	ILI9326_WriteCMD( ILI9326_R103_PC4, 0x0D00 );    /*factor of VREG1OUT for VCOM alternating voltage */
	ILI9326_WriteCMD( ILI9326_R401_BIDC, 0x0000 );   /*non-lit display level,vertical roll OFF,display invert OFF */
	ILI9326_WriteCMD( ILI9326_R002_DWC, 0x0100 );    /*line inversion */
	ILI9326_WriteCMD( ILI9326_R001_DOC, 0x0100 );    /*source driver shift form s1 to s720, */
	ILI9326_WriteCMD( ILI9326_R007_DC1, 0x0000 );    /*partial display disable,base image display disbale */
}




/**************************************************************************************************
* [Function] LCD_DrawPixelEx:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 color: description
**************************************************************************************************/
void ILI9326_DrawPixelEx( u16 x, u16 y, u16 color )
{
//	t_Point p;
//	p.x	= x;
//	p.y	= y;
//	ILI9326_DrawDot(p,color);		//画点
}


/**************************************************************************************************
* [Function] LCD_GetPixel:  函数功能、注意事项等的描述
* [param01]u16 X0: description
* [param02]u16 Y0: description
* [return]u16: description
**************************************************************************************************/
u16 ILI9326_GetPixel( t_Sreen_Rotate ScrnRotat, t_PixCfg PixCfg, t_Point p )
{
	u16 Dat = 0;
	ILI9326_SetGramAddress( p );
	ILI9326_ReadData();
	Dat = ILI9326_ReadData();
	return(Dat);
}


/**************************************************************************************************
* [Function] LCD_DrawHLine:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 Len: description
* [param04]u16 color: description
**************************************************************************************************/
void ILI9326_DrawHLine( u16 x, u16 y, u16 Len, u16 color )
{
	u16 i;

	for ( i = 0; i < Len; i++ )
		ILI9326_DrawPixelEx( i + x, y, color );
}


/**************************************************************************************************
* [Function] LCD_DrawVLine:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 Len: description
* [param04]u16 color: description
**************************************************************************************************/
void ILI9326_DrawVLine( u16 x, u16 y, u16 Len, u16 color )
{
	u16 i;
	for ( i = 0; i < Len; i++ )
		ILI9326_DrawPixelEx( x, i + y, color );
}


/**************************************************************************************************
* [Function] LCD_SetDispalyRange:  函数功能、注意事项等的描述
* [param01]t_LcdCfg * pLcdCfg: description
* [param02]u16 StartLine: description
* [param03]u16 LineNum: description
**************************************************************************************************/
void ILI9326_SetDispalyRange( u16 StartLine, u16 LineNum )
{
	u16	DC1 = 0;
	u16	Width, Height;

	if ( LineNum < LCD_PHY_HEIGHT )
	{
		DC1 = (u16) LCD_DC1_IMAGE_ENABLE_BIT;
		ILI9326_WriteCMD( ILI9326_R500_PTDP, StartLine );
		ILI9326_WriteCMD( ILI9326_R501_PTSA, 0 );
		ILI9326_WriteCMD( ILI9326_R502_PTEA, LineNum - 1 );
		Height	= LineNum;
		Width	= LCD_PHY_WIDTH;
	}else {
		DC1	= (u16) LCD_DC1_PARTIAL_ENABLE_BIT;
		Height	= LCD_PHY_HEIGHT;
		Width	= LCD_PHY_WIDTH;
	}

	if ( (ILI9326_GetCfg()->ScrnRotat == SCREEN_ROTATE_0D) || (ILI9326_GetCfg()->ScrnRotat == SCREEN_ROTATE_180D) )
	{
		ILI9326_GetCfg()->PixCfg.XPixNum	= Width;
		ILI9326_GetCfg()->PixCfg.YPixNum	= Height;
	}else {
		ILI9326_GetCfg()->PixCfg.XPixNum	= Height;
		ILI9326_GetCfg()->PixCfg.YPixNum	= Width;
	}

	ILI9326_WriteCMD( ILI9326_R007_DC1, DC1 );
}


/**************************************************************************************************
* [Function] LCD_DrawBox:  同过顶点和底部坐标画一个矩形
* [param01]t_WinCfg cfg: LCD 相关配置参数
* [param02]t_Point * pTop: description
* [param03]t_Point * pBottom: description
**************************************************************************************************/
void ILI9326_DrawBox( t_Point Top, t_Point Bottom )
{
	u32 i, Cnt;

	Cnt = (Bottom.x - Top.x + 1) * (Bottom.y - Top.y + 1);

	ILI9326_SetDrawWindow( Top, Bottom );
	ILI9326_SetGramAddress( Top );

	ILI9326_CS_LOW;
	ILI9326_RS_HIGH;
	ILI9326_RD_HIGH;


	for ( i = 0; i < Cnt; i++ )
	{
	
		ILI9326_DATABUS_PORT->ODR = ILI9326_GetCfg()->ForeColor;
		ILI9326_WR_LOW;
		ILI9326_WR_HIGH;
	}
	ILI9326_CS_HIGH;
}


///**************************************************************************************************
//* [Function] LCD_DrawLine:  AB 两个坐标画一条直线
//* [param01]t_Point * pPointA: A点坐标
//* [param02]t_Point * pPointB: b点坐标
//* [param03]u16 color: 颜色
//**************************************************************************************************/
//void ILI9326_DrawLine( t_Point *pPointA, t_Point *pPointB, u16 color )
//{
//	s16	x, y, dx, dy, s1, s2;
//	s16	i, p, temp, interchange;


//	x	= pPointA->x;
//	y	= pPointA->y;

//	dx = pPointB->x - pPointA->x;
//	if ( dx < 0 )
//		dx = -dx;
//	dy = pPointB->y - pPointA->y;
//	if ( dy < 0 )
//		dy = -dy;

//	if ( pPointB->x > pPointA->x )
//		s1 = 1;
//	else
//		s1 = -1;

//	if ( pPointB->y > pPointA->y )
//		s2 = 1;
//	else
//		s2 = -1;

//	if ( dy > dx )
//	{
//		temp		= dx;
//		dx		= dy;
//		dy		= temp;
//		interchange	= 1;
//	}else {
//		interchange = 0;
//	}

//	p = 2 * dy - dx;

//	for ( i = 1; i <= dx; i++ )
//	{
//		ILI9326_DrawPixelEx( x, y, color );
//		if ( p >= 0 )
//		{
//			if ( interchange == 0 )
//				y += s2;
//			else
//				x += s1;
//			p -= 2 * dx;
//		}
//		if ( interchange == 0 )
//			x += s1;
//		else
//			y += s2;
//		p += 2 * dy;
//	}
//}


///**************************************************************************************************
//* [Function] LCD_DrawRectangle:  画一下矩形框
//* [param01]t_Point top_p: 顶点坐标值
//* [param02]t_Point botton_p : 地板坐标值
//**************************************************************************************************/
//void ILI9326_DrawRectangle( t_Point *pTop_p, t_Point *pBotton_p, u16 color )
//{
//	ILI9326_DrawHLine( pTop_p->x, pTop_p->y, pBotton_p->x - pTop_p->x + 1, color );
//	ILI9326_DrawVLine( pTop_p->x, pTop_p->y, pBotton_p->y - pTop_p->y + 1, color );
//	ILI9326_DrawHLine( pTop_p->x, pBotton_p->y, pBotton_p->x - pTop_p->x + 1, color );
//	ILI9326_DrawVLine( pBotton_p->x, pTop_p->y, pBotton_p->y - pTop_p->y + 1, color );
//}


///**************************************************************************************************
//* [Function] LCD_DrawCircle:  函数功能、注意事项等的描述
//* [param01]t_Point point: description
//* [param02]u16 R: description
//* [param03]uint8_t Filled: description
//* [param04]u16 color: description
//**************************************************************************************************/
//void ILI9326_DrawCircle( t_Point point, u16 R, u8 Filled, u16 color )
//{
//	s16 x, y, d;

//	x	= 0;
//	y	= R;
//	d	= 1 - R;

//	while ( x < y )
//	{
//		if ( Filled )
//		{
//			ILI9326_DrawHLine( -y + point.x, x + point.y, 2 * y, color );
//			ILI9326_DrawHLine( -x + point.x, y + point.y, 2 * x, color );
//			ILI9326_DrawHLine( -x + point.x, -y + point.y, 2 * x, color );
//			ILI9326_DrawHLine( -y + point.x, -x + point.y, 2 * y, color );
//		}
//		else
//		{
//			ILI9326_DrawPixelEx( y + point.x, x + point.y, color );
//			ILI9326_DrawPixelEx( x + point.x, y + point.y, color );
//			ILI9326_DrawPixelEx( x + point.x, -y + point.y, color );
//			ILI9326_DrawPixelEx( y + point.x, -x + point.y, color );
//			ILI9326_DrawPixelEx( -y + point.x, x + point.y, color );
//			ILI9326_DrawPixelEx( -x + point.x, y + point.y, color );
//			ILI9326_DrawPixelEx( -x + point.x, -y + point.y, color );
//			ILI9326_DrawPixelEx( -y + point.x, -x + point.y, color );
//		}

//		if ( d < 0 )
//			d += 2 * x + 3;
//		else{
//			d += 2 * (x - y) + 5;
//			y--;
//		}
//		x++;
//	}
//}


