wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
/*******************************************************************************
*函数名		:	Address_set
*功能描述	:	STM32内部温度传感器配置
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void ILI9326_Address_set(unsigned int x1,unsigned int y1,unsigned int x2,unsigned int y2)
{ 
	ILI9326_Write_Bus(0x002A);			//设置列地址
	ILI9326_WriteData(x1>>8);	    
	ILI9326_WriteData(x1&0x00ff);
	ILI9326_WriteData(x2>>8);	    
	ILI9326_WriteData(x2&0x00ff);
	ILI9326_Write_Bus(0x002b);			//设置页地址	
	ILI9326_WriteData(y1>>8);	    
	ILI9326_WriteData(y1&0x00ff);
	ILI9326_WriteData(y2>>8);	    
	ILI9326_WriteData(y2&0x00ff);
	ILI9326_Write_Bus(0x002c);			//写内存起始地址 					 						 
}
///*******************************************************************************
//*函数名		:	LCD_Fill
//*功能描述	:	在指定区域内填充指定颜色
//*输入			: 区域大小:(xend-xsta)*(yend-ysta)
//*输出			:	无
//*返回值		:	无
//*例程			:
//*******************************************************************************/
//void ILI9326_Fill(
//							u16 xsta,u16 ysta,
//							u16 xend,u16 yend,u16 color
//)
//{          
//	u16 i,j; 
//	ILI9326_Address_set(xsta,ysta,xend,yend);      //设置光标位置 
//	for(i=ysta;i<=yend;i++)
//	{													   	 	
//		for(j=xsta;j<=xend;j++)
//			ILI9326_WriteData(color);//设置光标位置 	    
//	} 					  	    
//}

/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/
/*************************************************************************************************************************************************/


/*******************************************************************************
*函数名			:	ILI9326_WriteCommand
*功能描述		:	写完整控制命令
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_WriteCommand(												//写完整控制命令
													unsigned int index,			//寄存器索引
													unsigned int Command		//命令
													)	//写完整控制命令
{
	ILI9326_WriteIndex(index);		//写16位命令索引编号
	ILI9326_Delay(10);
	ILI9326_WriteData16(Command);
}
/*******************************************************************************
*函数名			:	ILI9326_SetWindowAddress
*功能描述		:	设置窗口地址
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_SetWindowAddress(			//设置窗口地址
															unsigned int xs,		//X起始点
															unsigned int ys,		//X起始点
															unsigned int xe,		//X终止点
															unsigned int ye			//X终止点
															)
{	
	ILI9326_WriteCommand(0x210,xs);			//Window Horizontal RAM Address Start(R210h)
	ILI9326_WriteCommand(0x211,xe);			//Window Horizontal RAM Address End(R211h)
	ILI9326_WriteCommand(0x212,ys);			//Window Vertical RAM Address Start (R212h)
	ILI9326_WriteCommand(0x213,ye);			//Window Vertical RAM Address End (R213h)
	
	ILI9326_WriteCommand(0x200,xs);			//RAM Address Set (Horizontal Address) (R200h)
	ILI9326_WriteCommand(0x201,ys);			//RAM Address Set (Vertical Address) (R201h)
	ILI9326_WriteIndex(0x0202);				//GRAM(Graphics RAM--图形内存) Data Write (R202h)准备写入
}


/*******************************************************************************
*函数名			:	ILI9326_Initialize
*功能描述		:	IC初始化：按照主控芯片ILI9326的power supply on sequence 进行配置
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_Initialize0(void)			//按照主控芯片ILI9326的power supply on sequence 进行配置
{
	u32 dtime=500;
	#if 1
/********************************************************************************************************
	ILI9326_WR_HIGH;
	ILI9326_RD_HIGH;
	ILI9326_CS_LOW;
	ILI9326_RST_HIGH;
	ILI9326_Delay(dtime);
	ILI9326_RST_LOW;
	ILI9326_Delay(dtime);
	ILI9326_RST_HIGH;
	
	ILI9326_WriteCommand(ILI9326_R000_IR		,	0x0000);		ILI9326_Delay(dtime); //四次写0x00
	ILI9326_WriteCommand(ILI9326_R000_IR		,	0x0000);		ILI9326_Delay(dtime); //四次写0x00
	ILI9326_WriteCommand(ILI9326_R000_IR		,	0x0000);		ILI9326_Delay(dtime); //四次写0x00
	ILI9326_WriteCommand(ILI9326_R000_IR		,	0x0000);		ILI9326_Delay(dtime); //四次写0x00
	
	ILI9326_WriteCommand(ILI9326_R001_DOC		,	0x0100);		ILI9326_Delay(dtime); //--------显示方向控制When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
	ILI9326_WriteCommand(ILI9326_R002_DWC		,	0x0100);		ILI9326_Delay(dtime); //--------	
	ILI9326_WriteCommand(ILI9326_R003_EM		,	0X5030);		ILI9326_Delay(dtime); //--------RGB设为5-6-5模式------------0X5030
	ILI9326_WriteCommand(ILI9326_R007_DC1		,	0x0100);		ILI9326_Delay(dtime); //--------测试显示控制base image的关与开
	ILI9326_WriteCommand(ILI9326_R008_DC2		,	0X0808);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R009_DC3		,	0x0001);		ILI9326_Delay(dtime); //--------
	
	
	
	ILI9326_WriteCommand(ILI9326_R400_BINL	,	0X6400);		ILI9326_Delay(dtime); //base image 设置 400线
	
	
	ILI9326_WriteCommand(ILI9326_R300_YC1		,	0x0C00);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R301_YC2		,	0x5A0B);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R302_YC3		,	0x0906);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R303_YC4		,	0x1017);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R304_YC5		,	0x2300);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R305_YC6		,	0x1700);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R306_YC7		,	0x6309);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R307_YC8		,	0x0C09);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R308_YC9		,	0x100C);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R309_YC10	,	0x2232);		ILI9326_Delay(dtime); //--------
	
	ILI9326_WriteCommand(ILI9326_R010_PIC1	,	0x001F);		ILI9326_Delay(dtime); //--------面板频率--0x19
	ILI9326_WriteCommand(ILI9326_R100_PC1		,	0x0330);		ILI9326_Delay(dtime); //--------设置电源控制，平衡显示与电消耗
	ILI9326_WriteCommand(ILI9326_R101_PC2		,	0x0247);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R102_PC3		,	0xC1B0);		ILI9326_Delay(dtime); //--------PSON,PON 都设为1，电源供应打开
	
	
