wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
	ILI9326_WriteCommand(ILI9326_R00B_ECC		,	0x0001);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R00C_EDIC1	,	0x0000);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R00F_EDIC2	,	0x0000);		ILI9326_Delay(dtime); //--------
	
	ILI9326_WriteCommand(ILI9326_R011_PIC2	,	0x0101);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R012_PIC3	,	0x0000);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R013_PIC4	,	0x0001);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R014_PIC5	,	0x0055);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R020_PIC6	,	0x0019);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R021_PIC7	,	0x0101);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R022_PIC8	,	0x0000);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R023_PIC9	,	0x0001);		ILI9326_Delay(dtime); //--------
	
	ILI9326_WriteCommand(ILI9326_R090_FMC		,	0x8000);		ILI9326_Delay(dtime); //--------窗特征控制，FMARK interface
	ILI9326_WriteCommand(ILI9326_R103_PC4		,	0x0D00);		ILI9326_Delay(dtime); //--------
	ILI9326_WriteCommand(ILI9326_R401_BIDC	,	0x0004);		ILI9326_Delay(dtime); //--------设置base image 滚动模式，开启滚动(颜色反相设置）

	
	ILI9326_WriteCommand(ILI9326_R280_NVM		,	0xB000);		ILI9326_Delay(dtime);	//--------VCM	
	ILI9326_WriteCommand(ILI9326_R502_PTEA	,	0x005f);		ILI9326_Delay(dtime);
	ILI9326_WriteCommand(ILI9326_R404_BIVSC	,	0x0000);		ILI9326_Delay(dtime);	//--------从0线开始滚
	ILI9326_WriteCommand(ILI9326_R200_HA		,	0x0000);		ILI9326_Delay(dtime);	//--------RAM address 设置
	ILI9326_WriteCommand(ILI9326_R201_VA		,	0x0000);		ILI9326_Delay(dtime);	//--------
	
	
	//-----------------测试开始	
//	ILI9326_WriteCommand(ILI9326_R210_HSA		,	0x0015);		ILI9326_Delay(dtime);	//--------RAM address 设置
//	ILI9326_WriteCommand(ILI9326_R211_HEA		,	0x00E0);		ILI9326_Delay(dtime);	//--------
//	
//	ILI9326_WriteCommand(ILI9326_R212_VSA		,	0x0015);		ILI9326_Delay(dtime);	//--------RAM address 设置
//	ILI9326_WriteCommand(ILI9326_R213_VEA		,	0x00FF);		ILI9326_Delay(dtime);	//--------
//	
//	ILI9326_WriteCommand(ILI9326_R200_HA		,	0x0015);		ILI9326_Delay(dtime);	//--------RAM address 设置
//	ILI9326_WriteCommand(ILI9326_R201_VA		,	0x0015);		ILI9326_Delay(dtime);	//--------
	//-----------------测试结束

	ILI9326_WriteIndex(0X202);					ILI9326_Delay(dtime);		//准备写入

//	ILI9326_Rotate=SCREEN_ROTATE_0D;				//显示方式
************************************************************************************************************************************/	
	ILI9326_WR_HIGH;
	ILI9326_RD_HIGH;
	ILI9326_CS_LOW;
	ILI9326_RST_HIGH;
	ILI9326_Delay(dtime);
	ILI9326_RST_LOW;
	ILI9326_Delay(dtime);
	ILI9326_RST_HIGH;
	
	ILI9326_WriteCommand(0x0702, 0x3008);// Set internal timing, don’t change this value
	ILI9326_WriteCommand(0x0705, 0x0036);// Set internal timing, don’t change this value  
	ILI9326_WriteCommand(0x070B, 0x1213);// Set internal timing, don’t change this value 

	ILI9326_WriteCommand(0x0001, 0x0100); // set SS and SM bit
	ILI9326_WriteCommand(0x0002, 0x0100); // set 1 line inversion
	ILI9326_WriteCommand(0x0003, 0x1030); // set GRAM write direction and BGR=1.

	
	ILI9326_WriteCommand(0x0008, 0x0202); // set the back porch and front porch
	ILI9326_WriteCommand(0x0009, 0x0000); // set non-display area refresh cycle ISC[3:0]
	ILI9326_WriteCommand(0x000A, 0x0000); // FMARK function
	ILI9326_WriteCommand(0x000C, 0x0000); // RGB interface setting
	ILI9326_WriteCommand(0x000D, 0x0000); // Frame marker Position
	ILI9326_WriteCommand(0x000F, 0x0000); // RGB interface polarity
	//Power On sequence
	
	ILI9326_WriteCommand(0x0100, 0x0000); // // SAP, BT[3:0], AP, DSTB, SLP, STB
	ILI9326_WriteCommand(0x0102, 0x0000); // VREG1OUT voltage
	ILI9326_WriteCommand(0x0103, 0x0000); // VDV[4:0] for VCOM amplitude
//	ILI9326_Delay(dtime); // Delay 50ms
	ILI9326_WriteCommand(0x0100, 0x1190); // // SAP, BT[3:0], AP, DSTB, SLP, STB,0x1190
	ILI9326_WriteCommand(0x0101, 0x0005); // DC1[2:0], DC0[2:0], VC[2:0]//0x0227
//	ILI9326_Delay(dtime);
	ILI9326_WriteCommand(0x0102, 0x01b8); // VREG1OUT voltage
//	ILI9326_Delay(dtime);
	ILI9326_WriteCommand(0x0103, 0x3600); //DV[4:0] for VCOM amplitude
	ILI9326_WriteCommand(0x0281, 0x0001); // VCM[5:0] for VCOMH
//	ILI9326_Delay(dtime);
	ILI9326_WriteCommand(0x0200, 0x0000); // GRAM horizontal Address
	 
	ILI9326_WriteCommand(0x0201, 0x0000); //GRAM horizontal Address
	//Adjust the Gamma Curve
	
	ILI9326_WriteCommand(0x0300, 0x0101);//
	ILI9326_WriteCommand(0x0301, 0x0506);//
	ILI9326_WriteCommand(0x0302, 0x0405);//
	
	ILI9326_WriteCommand(0x0305, 0x0007);//
	
	ILI9326_WriteCommand(0x0306, 0x0008);//
	
	ILI9326_WriteCommand(0x0307, 0x0203);//
	ILI9326_WriteCommand(0x0308, 0x0102);//
	ILI9326_WriteCommand(0x0309, 0x0706);//
	
	ILI9326_WriteCommand(0x030C, 0x0700);//
	
	ILI9326_WriteCommand(0x030D, 0x0008);//
	
		
	//Set GRAM area
	ILI9326_WriteCommand(0x0210, 0x0000); // Horizontal GRAM Start Address
	ILI9326_WriteCommand(0x0211, 0x00EF); // Horizontal GRAM End Address
	ILI9326_WriteCommand(0x0212, 0x0000); // Vertical GRAM Start Address
	ILI9326_WriteCommand(0x0213, 0x018F); // Vertical GRAM Start Address
	ILI9326_WriteCommand(0x0400, 0x3100); // Gate Scan Line
	ILI9326_WriteCommand(0x0401, 0x0001); // NDL,VLE, REV
	ILI9326_WriteCommand(0x0404, 0x0000); // set scrolling line
	//Partial Display Control
	ILI9326_WriteCommand(0x0500, 0x0000);
	ILI9326_WriteCommand(0x0501, 0x0000);
	ILI9326_WriteCommand(0x0502, 0x0000);
	ILI9326_WriteCommand(0x0503, 0x0000);
	ILI9326_WriteCommand(0x0504, 0x0000);
	ILI9326_WriteCommand(0x0505, 0x0000);
	//Panel Control
	ILI9326_WriteCommand(0x0010, 0x0010);
	ILI9326_WriteCommand(0x0011, 0x0600);
	ILI9326_WriteCommand(0x0020, 0x0002);
	 
	ILI9326_WriteCommand(0x0007, 0x0173); // 262K color and display ON
	ILI9326_WriteIndex(0x0202);
	SysTick_DeleymS(50);				//SysTick延时nmS
	
	
	
	
	
	
	
	


















//----正常201707181400
//	ILI9326_WR_HIGH;
//	ILI9326_RD_HIGH;
//	ILI9326_CS_LOW;
//	ILI9326_RST_HIGH;
//	ILI9326_Delay(dtime);
//	ILI9326_RST_LOW;
//	ILI9326_Delay(dtime);
//	ILI9326_RST_HIGH;
//	
//	ILI9326_WriteCommand(ILI9326_R000_IR		,		0x00);		ILI9326_Delay(dtime); //四次写0x00
//	ILI9326_WriteCommand(ILI9326_R000_IR		,		0x00);		ILI9326_Delay(dtime); //四次写0x00
//	ILI9326_WriteCommand(ILI9326_R000_IR		,		0x00);		ILI9326_Delay(dtime); //四次写0x00
//	ILI9326_WriteCommand(ILI9326_R000_IR		,		0x00);		ILI9326_Delay(dtime); //四次写0x00
//	
//	ILI9326_WriteCommand(ILI9326_R400_BINL	,	0X6400);		ILI9326_Delay(dtime); //base image 设置 400线
//	ILI9326_WriteCommand(ILI9326_R008_DC2		,	0X0808);		ILI9326_Delay(dtime); //--------
//	
//	ILI9326_WriteCommand(ILI9326_R300_YC1		,	0x0C00);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R301_YC2		,	0x5A0B);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R302_YC3		,	0x0906);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R303_YC4		,	0x1017);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R304_YC5		,	0x2300);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R305_YC6		,	0x1700);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R306_YC7		,	0x6309);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R307_YC8		,	0x0C09);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R308_YC9		,	0x100C);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R309_YC10	,	0x2232);		ILI9326_Delay(dtime); //--------
//	
//	ILI9326_WriteCommand(ILI9326_R010_PIC1	,	0x0019);		ILI9326_Delay(dtime); //--------面板频率
//	ILI9326_WriteCommand(ILI9326_R100_PC1		,	0x0330);		ILI9326_Delay(dtime); //--------设置电源控制，平衡显示与电消耗
//	ILI9326_WriteCommand(ILI9326_R101_PC2		,	0x0247);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R102_PC3		,	0xC1B0);		ILI9326_Delay(dtime); //--------PSON,PON 都设为1，电源供应打开
//	
//	ILI9326_WriteCommand(ILI9326_R009_DC3		,	0x0001);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R00B_ECC		,	0x0001);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R00C_EDIC1	,	0x0000);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R00F_EDIC2	,	0x0000);		ILI9326_Delay(dtime); //--------
//	
//	ILI9326_WriteCommand(ILI9326_R011_PIC2	,	0x0101);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R012_PIC3	,	0x0000);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R013_PIC4	,	0x0001);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R014_PIC5	,	0x0055);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R020_PIC6	,	0x0019);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R021_PIC7	,	0x0101);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R022_PIC8	,	0x0000);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R023_PIC9	,	0x0001);		ILI9326_Delay(dtime); //--------
//	
//	ILI9326_WriteCommand(ILI9326_R090_FMC		,	0x8000);		ILI9326_Delay(dtime); //--------窗特征控制，FMARK interface
//	ILI9326_WriteCommand(ILI9326_R103_PC4		,	0x0D00);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R401_BIDC	,	0x0004);		ILI9326_Delay(dtime); //--------设置base image 滚动模式，开启滚动(颜色反相设置）
//	ILI9326_WriteCommand(ILI9326_R002_DWC		,	0x0100);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(ILI9326_R001_DOC		,	0x0100);		ILI9326_Delay(dtime); //--------显示方向控制When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	ILI9326_WriteCommand(ILI9326_R003_EM		,	0X5030);		ILI9326_Delay(dtime); //--------RGB设为5-6-5模式------------0X5030
//	ILI9326_WriteCommand(ILI9326_R007_DC1		,	0x0100);		ILI9326_Delay(dtime); //--------测试显示控制base image的关与开
//	
//	ILI9326_WriteCommand(ILI9326_R280_NVM		,	0xB000);		ILI9326_Delay(dtime);	//--------VCM	
//	ILI9326_WriteCommand(ILI9326_R502_PTEA	,	0x005f);		ILI9326_Delay(dtime);
//	ILI9326_WriteCommand(ILI9326_R404_BIVSC	,	0x0000);		ILI9326_Delay(dtime);	//--------从0线开始滚
//	ILI9326_WriteCommand(ILI9326_R200_HA		,	0x0000);		ILI9326_Delay(dtime);	//--------RAM address 设置
//	ILI9326_WriteCommand(ILI9326_R201_VA		,	0x0000);		ILI9326_Delay(dtime);	//--------


//	ILI9326_WriteIndex(0X202);					ILI9326_Delay(dtime);		//准备写入

//	ILI9326_Rotate=SCREEN_ROTATE_270D;				//显示方式
	



//	ILI9326_WR_HIGH;
//	ILI9326_RD_HIGH;
//	ILI9326_CS_LOW;
//	ILI9326_RST_HIGH;
//	ILI9326_Delay(dtime);
//	ILI9326_RST_LOW;
//	ILI9326_Delay(dtime);
//	ILI9326_RST_HIGH;
//	
//	ILI9326_WriteCommand(ILI9326_R000_IR,0x00);			ILI9326_Delay(dtime); //四次写0x00
//	ILI9326_WriteCommand(ILI9326_R000_IR,0x00);			ILI9326_Delay(dtime); //四次写0x00
//	ILI9326_WriteCommand(ILI9326_R000_IR,0x00);			ILI9326_Delay(dtime); //四次写0x00
//	ILI9326_WriteCommand(ILI9326_R000_IR,0x00);			ILI9326_Delay(dtime); //四次写0x00
//	
//	ILI9326_WriteCommand(ILI9326_R400_BINL,0X6400);		ILI9326_Delay(dtime); //base image 设置 400线
//	ILI9326_WriteCommand(0X008,0X0808);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(0X300,0X0C00);		ILI9326_Delay(dtime); //--------
//	ILI9326_WriteCommand(0X010,0X0019);		ILI9326_Delay(dtime); //面板频率
//	ILI9326_WriteCommand(0X100,0X330);		ILI9326_Delay(dtime);	//设置电源控制，平衡显示与电消耗
//	ILI9326_WriteCommand(0x102,0xd1b0);		ILI9326_Delay(dtime);	//PSON,PON 都设为1，电源供应打开
//	ILI9326_WriteCommand(0x280,0xbf00);		ILI9326_Delay(dtime);	//VCM


//	
//	ILI9326_WriteCommand(0X0003,0X5030);	ILI9326_Delay(500);	//RGB设为5-6-5模式------------0X5030

