wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
//	ILI9326_WriteCommand(0X0001,0X0100);	ILI9326_Delay(dtime);	//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
//	ILI9326_WriteCommand(0X007,0X0100);		ILI9326_Delay(dtime);	//测试显示控制base image的关与开

//	ILI9326_WriteCommand(0X200,0X00);			ILI9326_Delay(dtime); //设置RAM ADDRESS

//	ILI9326_WriteCommand(0X201,0X00);			ILI9326_Delay(dtime); 


//	ILI9326_WriteCommand(0X401,0X01);			ILI9326_Delay(dtime); //设置base image 滚动模式，开启滚动

//	ILI9326_WriteCommand(0x0C,0x0000);		ILI9326_Delay(dtime); //外部显示接口控制，默认值
//	ILI9326_WriteCommand(0x090,0x8000);		ILI9326_Delay(dtime); //窗特征控制，FMARK interface
//	ILI9326_WriteCommand(0X404,0X00);			ILI9326_Delay(dtime);  //从0线开始滚
//	

//	
//	
//	ILI9326_WriteCommand(0X502,0X5f);			ILI9326_Delay(dtime);
//	
//	
//	
//	ILI9326_WriteCommand(0x200,0x0000);		ILI9326_Delay(dtime);		//RAM address 设置

//	ILI9326_WriteCommand(0x201,0x0000);		ILI9326_Delay(dtime);

//	ILI9326_WriteIndex(0X202);					ILI9326_Delay(dtime);		//准备写入


//	ILI9326_Rotate=SCREEN_ROTATE_270D;				//显示方式
	
	
	#else
	
	
	ILI9326_WR_HIGH;
	ILI9326_RD_HIGH;
	ILI9326_CS_LOW;
	ILI9326_RST_HIGH;
	ILI9326_Delay(200);
	ILI9326_RST_LOW;
	ILI9326_Delay(2000);
	ILI9326_RST_HIGH;
	
	
	ILI9326_WriteCommand(0x00,0x00);ILI9326_Delay(500); //四次写0x00
	ILI9326_WriteCommand(0x00,0x00);ILI9326_Delay(500);
	ILI9326_WriteCommand(0x00,0x00);ILI9326_Delay(500);
	ILI9326_WriteCommand(0x00,0x00);ILI9326_Delay(500);
	ILI9326_WriteCommand(0X400,0X6200); //base image 设置 400线
	ILI9326_WriteCommand(0X010,0X0019); //面板频率
	ILI9326_WriteCommand(0X100,0X330);	//设置电源控制，平衡显示与电消耗
	ILI9326_WriteCommand(0x102,0xd1b0);ILI9326_Delay(500);//PSON,PON 都设为1，电源供应打开
	ILI9326_WriteCommand(0x280,0xbf00);ILI9326_Delay(500);//VCM
	ILI9326_Delay(500);
	ILI9326_WriteCommand(0X0003,0X5030);ILI9326_Delay(500);//RGB设为5-6-5模式
	ILI9326_Delay(200);
	ILI9326_WriteCommand(0X0001,0X0100);//When SS = “1” and BGR = “1”, RGB dots are assigned one to one from S720 to S1.
	ILI9326_WriteCommand(0X007,0X0100);//测试显示控制base image的关与开
	ILI9326_Delay(200);
	ILI9326_Delay(200);
	ILI9326_WriteCommand(0X200,0X00); //设置RAM ADDRESS
	ILI9326_Delay(200);
	ILI9326_WriteCommand(0X201,0X00); 
	ILI9326_Delay(200);


	ILI9326_Delay(200);
	ILI9326_WriteCommand(0X401,0X01); 										//设置base image 滚动模式，开启滚动
	ILI9326_Delay(200);
	ILI9326_WriteCommand(0x0C,0x0000);ILI9326_Delay(1000); //外部显示接口控制，默认值
	ILI9326_WriteCommand(0x090,0x8000);ILI9326_Delay(1000); //窗特征控制，FMARK interface
	ILI9326_WriteCommand(0X404,0X00);ILI9326_Delay(1000);  //从0线开始滚
	ILI9326_WriteCommand(0X502,0X5f);ILI9326_Delay(1000);
	ILI9326_WriteCommand(0x200,0x0000);		//RAM address 设置
	ILI9326_Delay(1000);
	ILI9326_WriteCommand(0x201,0x0000);
	ILI9326_Delay(1000);
	ILI9326_Delay(1000);
	ILI9326_WriteIndex(0X202);		//准备写入
	ILI9326_Delay(1000);
	#endif
}

/*******************************************************************************
*函数名			:	ILI9326_Clean
*功能描述		:	清屏程序：清除屏幕函数---用背景色填充屏幕
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_Clean(u16 COLOR)	//清除屏幕函数
{
#if 0
	unsigned char i;
	unsigned int j;

	ILI9326_SetWindowAddress(0x00,0x00,ILI9326_W-1,ILI9326_H-1);
	ILI9326_CS_LOW; //片选打开
	ILI9326_RS_HIGH; //数据
	for(j=1;j<=ILI9326_W;j++)
	{
		for(i=1;i<=ILI9326_H;i++)
		{
			
			ILI9326_WR_LOW;
			ILI9326_DATABUS_PORT->ODR = COLOR;
			ILI9326_WR_HIGH;
		}
	}
	ILI9326_CS_HIGH;
#else
	unsigned int i;
	unsigned int j;

	ILI9326_SetWindowAddress(0,0,ILI9326_H,ILI9326_W);
	
	ILI9326_CS_LOW; //片选打开
	ILI9326_RS_HIGH; //数据
//	SysTick_DeleymS(50);				//SysTick延时nmS
	for(j=1;j<=ILI9326_W;j++)
	{
		for(i=1;i<=ILI9326_H;i++)
		{
//		ILI9326_CS_LOW; //片选打开
//		ILI9326_RS_HIGH; //数据
		ILI9326_WR_LOW;
		ILI9326_DATABUS_PORT->ODR = COLOR;
//		SysTick_DeleyuS(1);				//SysTick延时nmS
		ILI9326_WR_HIGH;
//		ILI9326_CS_HIGH;
		}
	}
	ILI9326_CS_HIGH;
#endif
} 
/*******************************************************************************
*函数名			:	ILI9326_Clean
*功能描述		:	显示汉字程序
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_CHINESE(unsigned char zimo[720],unsigned int backcolor)  //写入字符
{
	unsigned char j,flag=0;
	unsigned char *point;
	unsigned int i,x1=0x00,x2=0x17,y1=0x00,y2=0x17;
	unsigned int colors[10]=
	{
		0xf800,0x07e0,0x001f,0xffe0,0x0000,0x07ff,0xf81f,0xb81f,0x7f7,0xfec0
	};
	point=&zimo[0];
	for(i=1;i<=720;i++,point++)
	{  
		for(j=0;j<=7;j++)
		{
			if((*point<<j)&0x80)
			{
				ILI9326_WriteData16(colors[flag]);
				ILI9326_Delay(1);
			}
			else
			{
				ILI9326_WriteData16(backcolor);
				ILI9326_Delay(1);
			}
		}   
		if(i%72==0)
		{
			x1=x1+24;x2=x2+24;y1=y1+24;y2=y2+24;
			flag=flag+1;
			ILI9326_SetWindowAddress(x1,y1,x2,y2);
		}   
	}
}
/*******************************************************************************
*函数名			:	ILI9326_DrawPoint
*功能描述		:	画点
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_DrawDot(u16 x,u16 y,u16 color)
{
//	ILI9326_W 400
//	ILI9326_H 240
	u16 x1=0,y1=0;
	switch(ILI9326_Rotate)
	{
		case SCREEN_ROTATE_0D:{}
			break;
		case SCREEN_ROTATE_90D:{x1=ILI9326_H-y;y=x;x=x1;}
			break;
		case SCREEN_ROTATE_180D:{x1=ILI9326_H-x;y=ILI9326_W-y;x=x1;}
			break;
		case	SCREEN_ROTATE_270D:{x1=y;y=ILI9326_W-x;x=x1;}
			break;
		default: break;			
	}

	ILI9326_SetWindowAddress(x,y,x,y);	//设置光标位置 
	ILI9326_WriteData16(color); 	//笔画颜色	    
}
/*******************************************************************************
*函数名			:	ILI9326_DrawPoint_big
*功能描述		:	画一个大点
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_DrawDot_big(u16 x,u16 y,u16 color)
{
//	if((x<=5)&&(y<=5))
//	{
//		ILI9326_Fill(0,0,x+10,y+10,color);
//	}
//	else if((x>5)&&(y<=5))
//	{
//		ILI9326_Fill(x-5,0,x+5,y+10,color);
//	}
//	else if((x<=5)&&(y>5))
//	{
//		ILI9326_Fill(0,y-5,x+10,y+5,color);
//	}
//	else if((x>5)&&(y>5))
//	{
//		ILI9326_Fill(x-5,y-5,x+5,y+5,color);
//	}
	
	if((x==0)&&(y==0))
	{
		ILI9326_Fill(0,0,x+2,y+2,color);
	}
	else if((x>0)&&(y>0))
	{
		ILI9326_Fill(x-1,y-1,x+1,y+1,color);
	}
	
//	ILI9326_Fill(x-1,y-1,x+1,y+1,color);
}
/*******************************************************************************
*函数名			:	ILI9326_DrawPoint_big
*功能描述		:	在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
*输入				: 
*返回值			:	无
*******************************************************************************/
void ILI9326_Fill(
							u16 xsta,u16 ysta,
							u16 xend,u16 yend,
							u16 color
)
{          
	unsigned int i;
	unsigned int j;	
//	u16 x1=0,y1=0,x2=0,y2=0;

