wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
//	switch(ILI9326_Rotate)
//	{
//		case 	SCREEN_ROTATE_0D:		
//					{
//						xend=xend-1;
//						yend=yend-1;
//					}
//			break;
//		case 	SCREEN_ROTATE_90D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;	
//						xsta=ILI9326_H-y2;	xend=ILI9326_H-y1-1;
//						ysta=x1;	yend=x2-1;
//					}
//			break;
//		case 	SCREEN_ROTATE_180D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;
//						xsta=ILI9326_H-x2;	xend=ILI9326_H-x1-1;
//						ysta=ILI9326_W-y2;	yend=ILI9326_W-y1-1;
//					}
//			break;
//		case	SCREEN_ROTATE_270D:	
//					{
//						x1=xsta;x2=xend;y1=ysta;y2=yend;
//						xsta=y1;	xend=y2-1;
//						ysta=ILI9326_W-x2;	yend=ILI9326_W-x1-1;
//					}
//			break;
//		default: break;			
//	}
	
//	switch(ILI9326_Rotate)
//	{
//		case SCREEN_ROTATE_0D:{}
//			break;
//		case SCREEN_ROTATE_90D:{x1=ILI9326_H-y;y=x;x=x1;}
//			break;
//		case SCREEN_ROTATE_180D:{x1=ILI9326_H-x;y=ILI9326_W-y;x=x1;}
//			break;
//		case	SCREEN_ROTATE_270D:{x1=y;y=ILI9326_W-x;x=x1;}
//			break;
//		default: break;			
//	}

	ILI9326_SetWindowAddress(xsta,ysta,xend,yend);
	ILI9326_CS_LOW; 					//片选打开
	ILI9326_RS_HIGH; 					//数据
	for(i=0;i<xend-xsta;i++)
	{
		for(j=0;j<yend-ysta;j++)
		{
			ILI9326_WR_LOW;
			ILI9326_DATABUS_PORT->ODR = color;
			ILI9326_WR_HIGH;
		}
	}
	ILI9326_CS_HIGH;	
}
/*******************************************************************************
*函数名			:	ILI9326_DrawPoint_big
*功能描述		:	在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
*输入				: 
*返回值			:	无
*******************************************************************************/
/*******************************************************************************
*函数名		:	LCD_DrawLine
*功能描述	:	画线
*输入			: x1,y1:起点坐标
						x2,y2:终点坐标
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void ILI9326_DrawLine(
									u16 x1, u16 y1, 	//x1,y1:起点坐标
									u16 x2, u16 y2,		//x2,y2:终点坐标
									u16 color					//颜色
)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 

	delta_x=x2-x1; //计算坐标增量 
	delta_y=y2-y1; 
	uRow=x1; 
	uCol=y1; 
	if(delta_x>0)
		incx=1; //设置单步方向 
	else if(delta_x==0)
		incx=0;//垂直线 
	else
		{
			incx=-1;
			delta_x=-delta_x;
		} 
	if(delta_y>0)
		incy=1; 
	else if(delta_y==0)
		incy=0;//水平线 
	else
		{incy=-1;delta_y=-delta_y;} 
		
	if( delta_x>delta_y)
		distance=delta_x; 								//选取基本增量坐标轴 
	else
		distance=delta_y; 
	for(t=0;t<distance+1;t++ )					//画线输出 
	{  
		ILI9326_DrawDot(uRow,uCol,color);	//画点 
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}  
}
/**************************************************************************************************
* [Function] LCD_DrawCircle:  函数功能、注意事项等的描述
* [param01]t_Point point: description
* [param02]u16 R: description
* [param03]uint8_t Filled: description
* [param04]u16 color: description
**************************************************************************************************/
void ILI9326_DrawCircle(
												u16 x,u16 y,		//圆心坐标原点
												u16 r,					//半径
												u8 Filled,			//是否填充
												u16 color				//颜色
												)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);             //判断下个点位置的标志
	while(a<=b)
	{
		if(Filled)	//填充就画线
		{
			ILI9326_DrawLine(x,y,x-b,y-a,color);             //3           
			ILI9326_DrawLine(x,y,x+b,y-a,color);             //0           
			ILI9326_DrawLine(x,y,x-a,y+b,color);             //1       
			ILI9326_DrawLine(x,y,x-b,y-a,color);             //7           
			ILI9326_DrawLine(x,y,x-a,y-b,color);             //2             
			ILI9326_DrawLine(x,y,x+b,y+a,color);             //4               
			ILI9326_DrawLine(x,y,x+a,y-b,color);             //5
			ILI9326_DrawLine(x,y,x+a,y+b,color);             //6 
			ILI9326_DrawLine(x,y,x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
			ILI9326_DrawLine(x,y,x+a,y+b,color);				//AB 两个坐标画一条直线

		}
		else
		{
			ILI9326_DrawDot(x-b,y-a,color);             //3           
			ILI9326_DrawDot(x+b,y-a,color);             //0           
			ILI9326_DrawDot(x-a,y+b,color);             //1       
			ILI9326_DrawDot(x-b,y-a,color);             //7           
			ILI9326_DrawDot(x-a,y-b,color);             //2             
			ILI9326_DrawDot(x+b,y+a,color);             //4               
			ILI9326_DrawDot(x+a,y-b,color);             //5
			ILI9326_DrawDot(x+a,y+b,color);             //6 
			ILI9326_DrawDot(x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
				ILI9326_DrawDot(x+a,y+b,color);
		}
	}
}
/**************************************************************************************************
* [Function] LCD_DrawRectangle:  画一下矩形框
* [param01]t_Point top_p: 顶点坐标值
* [param02]t_Point botton_p : 地板坐标值
**************************************************************************************************/
void ILI9326_DrawRectangle(u16 x1,u16 y1,u16 x2,u16 y2,u16 color)
{
	ILI9326_DrawLine( x1, y1,	x1,	y2, color );
	ILI9326_DrawLine( x1, y1,	x2,	y1, color );
	ILI9326_DrawLine( x2, y1,	x2,	y2, color );
	ILI9326_DrawLine( x1, y2,	x2,	y2, color );
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ILI9326_ShowChar(
										u16 x,			//x				:起点x坐标
										u16 y,			//y				:起点y坐标
										u8 font,		//font		:字体大小
										u8 num,			//num			:字节数
										u8 *Buffer	//Buffer	:显示的内容缓存
)		//高通字库测试程序
{
	u8 temp;
//	u8 mode=0;
	u8 i=0,j=0;
//	u8 num=0;
//	u16 x0=x;
	u16 colortemp=ILI9326_POINT_COLOR;
	if(font==12)
	{
		if(x>ILI9326_W-12||y>ILI9326_H-12)
			return;
		ILI9326_SetWindowAddress(x,y,x+12-1,y+12-1);      //设置光标位置 
	}
	if(font==16)
	{
		if(x>ILI9326_W-16||y>ILI9326_H-16)
			return;
		ILI9326_SetWindowAddress(x,y,x+16-1,y+16-1);      //设置光标位置 
	}
	if(font==24)
	{
		if(x>ILI9326_W-24||y>ILI9326_H-24)
			return;
		ILI9326_SetWindowAddress(x,y,x+24-1,y+24-1);      //设置光标位置 
	}
	else if(font==32)
	{
		if(x>ILI9326_W-32||y>ILI9326_H-32)
			return;
		if(num==128)
		{
			ILI9326_SetWindowAddress(x,y,x+32-1,y+32);      //设置光标位置
		}
		else
		{
			ILI9326_SetWindowAddress(x,y,x+16-1,y+32-1);      //设置光标位置 
		}
	}
	else
	{
//		return ;
	}
//	SSD1963_DC_Data;			//数据/命令切换	//1-数据，0-命令
//	SSD1963_WR_Write; 		//0--写开启，1--写关闭
	i=0;
	for(i=0;i<num;i++)
	{ 
		u16 ILI9326_PEN_COLOR	=	ILI9326_BLUE;   	//画笔色	
		temp=Buffer[i];		 					//调用1608字体--二维数组形式--字库使用时取消 	
		for(j=0;j<8;j++)
		{
			if((temp&0x80)==0X80)
			{
				ILI9326_PEN_COLOR=ILI9326_POINT_COLOR;
			}
			else
				ILI9326_PEN_COLOR=ILI9326_BACK_COLOR;
			
			ILI9326_WriteData16(ILI9326_PEN_COLOR);
//			SSD1963_WR_Write; 		//0--写开启，1--写关闭
//			GPIO_Write(SSD1963_sPinfo->SSD1963_sDATABUS_PORT,POINT_COLOR);
//			SSD1963_WR_Read; 			//0--写开启，1--写关闭
//			LCD_WR_DATA(POINT_COLOR);
//			{
//				LCD_RS(1);
////				LCD_Writ_Bus(POINT_COLOR);
//				{
//					LCD_WR(0); 		//0--写开启，1--写关闭
//					GPIO_Write(LCD_DATABUS_PORT,POINT_COLOR);
//					LCD_WR(1); 		//0--写开启，1--写关闭
//				}
//			}
			temp=temp<<1;
		}
		ILI9326_POINT_COLOR=colortemp;	
	}	
//	SSD1963_WR_Read; 		//0--写开启，1--写关闭
//	ILI9326_POINT_COLOR=colortemp;	
}

