wegam/STM32F1xWorkSpace/Driver/Components/SCR/ILI9326 - 20180422.c
/*******************************************************************************
*函数名		:	LCD_ShowChar
*功能描述	:	在指定位置显示一个字符
*输入			: x,y		:起点坐标
						num		:要显示的字符:" "--->"~"
						mode	:叠加方式(1)还是非叠加方式(0)
						num		:要显示的字符:" "--->"~"
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void ILI9326_ShowCharT(u16 x,u16 y,u8 num,u8 mode)
{
//	ILI9326_BACK_COLOR	//背景色
//	ILI9326_POINT_COLOR	//画笔色
	u8 temp;
	u8 pos,t;
	u16 x0=x;
	u16 colortemp=ILI9326_POINT_COLOR; 
	if(x>ILI9326_W-16||y>ILI9326_H-16)
		return;	    
	//设置窗口		   
	num=num-' ';//得到偏移后的值
//	num=41;//得到偏移后的值
	
	
//	ILI9326_SetWindowAddress(x,y,x+8-1,y+16-1);      //设置光标位置 
	if(!mode) //非叠加方式
	{
		for(pos=0;pos<16;pos++)
		{ 
			temp=code_asc2_1608[(u16)num*16+pos];		 		//调用1608字体
//			temp=code_num_1608[(u16)num*16+pos];		 //调用1608字体
			for(t=0;t<8;t++)
			{                 
				if((temp&0x01)==0x01)
					ILI9326_POINT_COLOR=colortemp;
				else
					ILI9326_POINT_COLOR=ILI9326_BACK_COLOR;

				ILI9326_DrawDot(x,y,ILI9326_POINT_COLOR);//画一个点 
				
				temp=temp>>1; 
				x++;
			}
			x=x0;
			y++;
		}	
	}
	else//叠加方式
	{
		for(pos=0;pos<16;pos++)
		{
			temp=code_asc2_1608[(u16)num*16+pos];		 //调用1608字体
			for(t=0;t<8;t++)
			{                 
				if(temp&0x01)
					ILI9326_DrawDot(x+t,y+pos,ILI9326_POINT_COLOR);//画一个点     
				temp>>=1; 
			}
		}
	}
	ILI9326_POINT_COLOR=colortemp;	    	   	 	  
}













u32 ILI9326_mypow1(u8 m,u8 n)		//乘方
{
	u32 result=1;	 
	while(n--)
		result*=m;    
	return result;
}

void ILI9326_ShowEn(u16 x,u16 y,u32 num)
{         	
	u8 t=0,len=0;
	u32 num2=num;
	u8 enshow=0;
	while(num2)
	{
		num2=num2/10;
		len++;		
	}
	for(t=len;t>0;t--)
	{
		num2=ILI9326_mypow1(10,t-1);
		if(num>9)
		{
			enshow=num/num2;
			num=num%num2;
		}
		else
			enshow=(char)num;
	 	ILI9326_ShowCharT(x+8*(len-t),y,enshow+48,0); 
	}
}



//#endif//LCD_61509_EN
/************************************** The End Of FILE **************************************/


